[
    {
        "id": "LoanParticipationNote",
        "type": "Class",
        "name": "LoanParticipationNote",
        "explanatoryNote": "With an LPN, a lead bank underwrites and issues the loan. This lending institution then recruits other banks to participate and share the risks and profits on a pro rata basis. The lead lender keeps a partial interest in the loan and is responsible for servicing it.",
        "definition": "credit facility and fixed-income security that may be distributed across a group of lenders",
        "abbreviation": "LPN",
        "label": "loan participation note"
    },
    {
        "id": "CommercialLoan",
        "type": "Entity",
        "name": "CommercialLoan"
    },
    {
        "id": "FixedIncomeSecurity",
        "type": "Entity",
        "name": "FixedIncomeSecurity"
    },
    {
        "id": "CreditFacility",
        "type": "Entity",
        "name": "CreditFacility"
    },
    {
        "id": "Bookrunner",
        "type": "Class",
        "name": "Bookrunner",
        "definition": "financial institution (typically a commercial or investment bank) responsible for coordinating the arrangement, structuring, and marketing of the loan to potential lenders",
        "label": "bookrunner",
        "explanatoryNote": "A 'bookrunner' is primarily responsible for managing the distribution and sale of a security during a new issuance, while a 'lead arranger' is the primary bank that structures and leads a syndicated loan, often assigning portions of the loan to other banks to participate in the deal; essentially, the bookrunner focuses on selling the security to investors, while the lead arranger focuses on structuring the loan itself and coordinating the syndicate of lenders involved."
    },
    {
        "id": "FinancialInstitution",
        "type": "Entity",
        "name": "FinancialInstitution"
    },
    {
        "id": "FinanceSyndicateMember",
        "type": "Class",
        "name": "FinanceSyndicateMember",
        "explanatoryNote": "Syndicate members may include a variety of financial institutions, such as commercial banks, investment banks, institutional investors - insurance companies, pension funds, and hedge funds, and specialty finance firms, focused on specific industries or credit profiles, which may join syndicates for specialized or higher-risk loans.",
        "label": "finance syndicate member",
        "definition": "syndicate member that is a financial services provider that contributes funds to a syndicated loan or loan participation note"
    },
    {
        "id": "FinancialServiceProvider",
        "type": "Entity",
        "name": "FinancialServiceProvider"
    },
    {
        "id": "SyndicateMember",
        "type": "Entity",
        "name": "SyndicateMember"
    },
    {
        "id": "DocumentationAgent",
        "type": "Class",
        "name": "DocumentationAgent",
        "definition": "financial institution designated to oversee the drafting, negotiation, and finalization of the loan documentation",
        "label": "documentation agent"
    },
    {
        "id": "AdministrativeAgent",
        "type": "Class",
        "name": "AdministrativeAgent",
        "explanatoryNote": "An administrative agent is designated by the syndicate and granted the authority to disburse funds, collect payments, monitor compliance and act as the communications intermediary with the borrower on behalf of the syndicate. This coordination role is crucial to ensuring that lenders' rights and oblications are properly coordinated and to streamline operations. Their authority and the scope of what they can do is explicitly stated in the loan agreement, and does not allow unilateral decision making with respect to the terms of the loan.",
        "definition": "role of a financial institution (often one of the primary lenders in the syndicate) designated to act as an intermediary between the borrowers and the syndicate lenders",
        "label": "administrative agent"
    },
    {
        "id": "SyndicationAgent",
        "type": "Class",
        "name": "SyndicationAgent",
        "explanatoryNote": "Syndication agents are important at the beginning of the process, including setting up the syndicate, supporting distribution of the loan across lenders, marketing, and the like. They are far less involved in loan administration, which is managed by the administrative agent.",
        "definition": "financial institution (typically a commercial or investment bank) designated to help structure, arrange, and manage the loan syndication process",
        "label": "syndication agent"
    },
    {
        "id": "FinanceSyndicate",
        "type": "Class",
        "name": "FinanceSyndicate",
        "definition": "group of financial institutions or lenders that collectively agree to provide funding for a large loan to a single borrower",
        "label": "finance syndicate",
        "explanatoryNote": "Syndicates are formed to enable the provision of substantial financing amounts that would be challenging or risky for any one lender to offer alone. The syndicate structure allows lenders to share the loan amount, spreading both the funding and associated risks among multiple participants."
    },
    {
        "id": "Syndicate",
        "type": "Entity",
        "name": "Syndicate"
    },
    {
        "id": "SyndicatedLoan",
        "type": "Class",
        "name": "SyndicatedLoan",
        "explanatoryNote": "A syndicated loan enables pooling of funds from multiple financial institutions, typically under the leadership of one or more arranging banks. These kinds of credit agreements are often used by large corporations, private equity investors and government entities for significant capital needs such as acquisitions, project financing, or to meet operational requirements.",
        "label": "syndicated loan",
        "definition": "credit agreement in which a group of lenders, known as a syndicate, collectively provides a large loan to a single borrower"
    },
    {
        "id": "LeadArranger",
        "type": "Class",
        "name": "LeadArranger",
        "definition": "financial institution that spearheads the loan structuring and syndication process on behalf of the borrower",
        "label": "lead arranger",
        "explanatoryNote": "The lead arranger acts as the primary point of contact for the borrower. They perform credit analysis and due diligence, ensure that the structure meets borrowers goals, and coordinates with potential lenders regarding the initial structure and commitments."
    }
]