[
    {
        "id": "OwnersEquity",
        "type": "Class",
        "name": "OwnersEquity",
        "definition": "owners' share in a business plus operating profit",
        "label": "owners' equity",
        "explanatoryNote": "Owner's equity is represented by capital investments and accumulated earnings less any dividends or other financial obligations. It is typically used to talk about equity in a business, but may also refer to the net assets of a pool or special purpose vehicle."
    },
    {
        "id": "Expression",
        "type": "Entity",
        "name": "Expression"
    },
    {
        "id": "CapitalSurplus",
        "type": "Class",
        "name": "CapitalSurplus",
        "definition": "capital contributed in excess of the par value (stated value) of the ownership interest issued",
        "label": "capital surplus"
    },
    {
        "id": "PaidInCapital",
        "type": "Class",
        "name": "PaidInCapital",
        "definition": "assets received from investors in exchange for an ownership interest",
        "label": "paid-in capital"
    },
    {
        "id": "Income",
        "type": "Class",
        "name": "Income",
        "label": "income",
        "definition": "revenue received during a period of time",
        "explanatoryNote": "Income includes cash or cash equivalent(s) received during some period of time in exchange for labor or services, from the sale of goods or property, or as receipts from financial investments."
    },
    {
        "id": "MonetaryAmount",
        "type": "Entity",
        "name": "MonetaryAmount"
    },
    {
        "id": "FinancialAsset",
        "type": "Class",
        "name": "FinancialAsset",
        "label": "financial asset",
        "explanatoryNote": "Financial assets are typically more liquid than other tangible assets, such as commodities or real estate. Financial assets may not cover all assets that might be included on a balance sheet, and do not include tangible, physical assets or intangible assets such as intellectual property.",
        "definition": "non-physical, tangible asset whose value is derived from a contractual claim, such as bank deposits, bonds, stocks, rights, certificates, and bank balances"
    },
    {
        "id": "TangibleAsset",
        "type": "Entity",
        "name": "TangibleAsset"
    },
    {
        "id": "EarningsBeforeInterestTaxesDepreciationAmortization",
        "type": "Class",
        "name": "EarningsBeforeInterestTaxesDepreciationAmortization",
        "abbreviation": "EBITDA",
        "explanatoryNote": "By stripping out the non-cash depreciation and amortization expense as well as taxes and debt costs dependent on the capital structure, EBITDA attempts to represent cash profit generated by the company's operations. EBITDA is not a metric recognized under Generally Accepted Accounting Principles (GAAP). Some public companies report EBITDA in their quarterly results along with adjusted EBITDA figures typically excluding additional costs, such as stock-based compensation.",
        "definition": "measure of potential cash flow that excludes the effects of capital structure, taxes and non-cash expenses",
        "label": "earnings before interest, taxes, depreciation and amortization"
    },
    {
        "id": "ShareholdersEquity",
        "type": "Class",
        "name": "ShareholdersEquity",
        "definition": "equity that is manifested in the form of shares in an entity, fund or structured product",
        "label": "shareholders' equity"
    },
    {
        "id": "PhysicalAsset",
        "type": "Class",
        "name": "PhysicalAsset",
        "label": "physical asset",
        "definition": "tangible asset that has a material form, such as property, equipment, and inventory",
        "explanatoryNote": "Physical (tangible) assets are real items of value that are used to generate revenue for a company."
    },
    {
        "id": "RetainedEarnings",
        "type": "Class",
        "name": "RetainedEarnings",
        "explanatoryNote": "If the corporation takes a loss, then that loss is retained and called variously retained losses, accumulated losses or accumulated deficit. Retained earnings and losses are cumulative from year to year with losses offsetting earnings.",
        "label": "retained earnings",
        "definition": "net profits kept to accumulate in a business after dividends are paid"
    }
]