[
    {
        "id": "ElectronicMailAddress",
        "type": "Class",
        "name": "ElectronicMailAddress",
        "definition": "virtual address that defines an electronic messaging endpoint to which email messages can be delivered, typically via an Simple Mail Transfer Protocol (SMTP) based communications system",
        "explanatoryNote": "Electronic mail, abbreviated e-mail or email, is a method of composing, sending, and receiving messages over electronic communication systems. The term e-mail applies both to the Internet e-mail system based on the Simple Mail Transfer Protocol (SMTP) and to intranet systems allowing users within one company or organization to send messages to each other. Often these workgroup collaboration systems natively use non-standard protocols but have some form of gateway to allow them to send and receive Internet e-mail. Some organizations may use the Internet protocols for internal e-mail service.",
        "label": "electronic mail address",
        "abbreviation": "e-mail address"
    },
    {
        "id": "VirtualAddress",
        "type": "Entity",
        "name": "VirtualAddress"
    },
    {
        "id": "TelephoneNumber",
        "type": "Class",
        "name": "TelephoneNumber",
        "definition": "virtual address that may be assigned to a fixed-line telephone subscriber station connected to a telephone line or to a wireless electronic telephony device, such as a radio telephone or a mobile telephone, or to other devices or services for data transmission via the public switched telephone network (PSTN) or other public and private networks",
        "label": "telephone number",
        "explanatoryNote": "Telephone numbers are assigned within the framework of a national or regional telephone numbering plan to subscribers by telephone service operators, which may be commercial entities, state-controlled administrations, or other telecommunication industry associations.",
        "abbreviation": "phone number"
    },
    {
        "id": "VirtualLocation",
        "type": "Class",
        "name": "VirtualLocation",
        "label": "virtual location",
        "definition": "place that is not located in any single physical location; a network location without geographic boundaries"
    },
    {
        "id": "Location",
        "type": "Entity",
        "name": "Location"
    },
    {
        "id": "NetworkLocation",
        "type": "Class",
        "name": "NetworkLocation",
        "definition": "a virtual location that may be identified by a network address (an identifier for a node or interface)",
        "label": "network location"
    },
    {
        "id": "NotionalPlace",
        "type": "Class",
        "name": "NotionalPlace",
        "label": "notional place",
        "definition": "an abstract place; one of many commonly understood concepts such as domestic, Eurozone etc."
    },
    {
        "id": "hasURL",
        "type": "DatatypeProperty",
        "name": "hasURL",
        "label": "has URL",
        "definition": "links something to a web resource that specifies its location on a computer network and a method for retrieving it"
    },
    {
        "id": "hasWebsite",
        "type": "DatatypeProperty",
        "name": "hasWebsite",
        "definition": "links something to a page or set of related web pages located under a single domain name, typically produced by a single person or organization",
        "label": "has website",
        "explanatoryNote": "Web Design and Applications involve the standards for building and Rendering Web pages, including HTML, CSS, SVG, device APIs, and other technologies for Web Applications ('WebApps'). HTML (the Hypertext Markup Language) and CSS (Cascading Style Sheets) are two of the core technologies for building Web pages. HTML provides the structure of the page, CSS the (visual and aural) layout, for a variety of devices and services."
    },
    {
        "id": "hasElectronicMailAddress",
        "type": "ObjectProperty",
        "name": "hasElectronicMailAddress",
        "definition": "specifies an electronic messaging endpoint at which some entity may be located or contacted or may receive correspondence",
        "abbreviation": "has email address",
        "label": "has electronic mail address"
    },
    {
        "id": "hasTelephoneNumber",
        "type": "ObjectProperty",
        "name": "hasTelephoneNumber",
        "definition": "indicates a virtual address composed of a sequence of digits and symbols that may be assigned to a fixed-line telephone subscriber station, a wireless electronic telephony device, such as a radio telephone or a mobile telephone, or other similar device or service",
        "label": "has telephone number"
    }
]