[
    {
        "id": "EmploymentSituationSurvey",
        "type": "Class",
        "name": "EmploymentSituationSurvey",
        "label": "employment situation survey",
        "definition": "a survey conducted on a regular basis that presents analytical information focused on the employment characteristics of a given statistical area"
    },
    {
        "id": "CurrentEmploymentStatistics",
        "type": "Class",
        "name": "CurrentEmploymentStatistics",
        "definition": "survey conducted on a regular basis that presents analytical information related to businesses and government agencies, in order to provide detailed industry data on employment, hours, and earnings of workers",
        "label": "current employment statistics"
    },
    {
        "id": "CurrentPopulationSurvey",
        "type": "Class",
        "name": "CurrentPopulationSurvey",
        "label": "current population survey",
        "definition": "survey conducted on a regular basis that presents analytical information related to the general population of a given statistical area with respect to labor force, employment, unemployment, persons not in the labor force, hours of work, earnings, and other demographic and labor force characteristics"
    },
    {
        "id": "StatisticalProgram",
        "type": "Entity",
        "name": "StatisticalProgram"
    },
    {
        "id": "UrbanConsumersUniverse",
        "type": "Class",
        "name": "UrbanConsumersUniverse",
        "explanatoryNote": "In the United States, the CPI-U population, which covers about 88 percent of the U.S. population, covers households in all areas of the United States except people living in rural nonmetropolitan areas, in farm households, on military installations, in religious communities, and in institutions such as prisons and mental hospitals.",
        "definition": "a statistical universe for consumer expenditure surveys consisting of people within a household that make joint expenditure decisions",
        "label": "urban consumers universe"
    },
    {
        "id": "CivilianNonInstitutionalPopulation",
        "type": "Entity",
        "name": "CivilianNonInstitutionalPopulation"
    },
    {
        "id": "EmploymentSituationEstablishmentSurvey",
        "type": "Class",
        "name": "EmploymentSituationEstablishmentSurvey",
        "definition": "survey conducted on a regular basis that presents analytical information related to the labor force of a given statistical area, surveyed with respect to businesses, and is, for the most part, seasonally adjusted",
        "label": "employment situation establishment survey"
    },
    {
        "id": "PointOfPurchaseSurvey",
        "type": "Class",
        "name": "PointOfPurchaseSurvey",
        "label": "point of purchase survey",
        "definition": "a program conducted on a regular basis that provides information on purchases of various items and services by consumers"
    },
    {
        "id": "USProducerPriceIndex",
        "type": "Class",
        "name": "USProducerPriceIndex",
        "label": "U.S. producer price index",
        "definition": "an economic indicator representing a measure of the change over time in the selling prices received by domestic producers for their output"
    },
    {
        "id": "ProducerPriceIndex",
        "type": "Entity",
        "name": "ProducerPriceIndex"
    },
    {
        "id": "UrbanConsumerPriceIndex",
        "type": "Class",
        "name": "UrbanConsumerPriceIndex",
        "label": "urban consumer price index",
        "definition": "an economic indicator representing a measure of the average change over time in the prices paid by urban consumers for a market basket of consumer goods and services",
        "abbreviation": "CPI-U"
    },
    {
        "id": "ConsumerPriceIndex",
        "type": "Entity",
        "name": "ConsumerPriceIndex"
    },
    {
        "id": "EmploymentSituationHouseholdSurvey",
        "type": "Class",
        "name": "EmploymentSituationHouseholdSurvey",
        "definition": "a survey conducted on a regular basis that presents analytical information related to the labor force of a given statistical area, surveyed with respect to households, and is, for the most part, seasonally adjusted",
        "label": "employment situation household survey"
    },
    {
        "id": "AmericanStatisticsPublisher",
        "type": "Class",
        "name": "AmericanStatisticsPublisher",
        "label": "American statistics publisher",
        "definition": "statistical information publisher comprised of the government agencies and departments that publish statistical information on behalf of the U.S. Federal Government"
    },
    {
        "id": "StatisticalInformationPublisher",
        "type": "Entity",
        "name": "StatisticalInformationPublisher"
    },
    {
        "id": "ConsumerExpenditureSurvey",
        "type": "Class",
        "name": "ConsumerExpenditureSurvey",
        "definition": "statistical program conducted on a regular basis that provides information on the buying habits of consumers, including data on their expenditures, income, and consumer unit (families and single consumers) characteristics",
        "label": "consumer expenditure survey"
    },
    {
        "id": "BureauOfLaborStatistics",
        "type": "GovernmentAgency",
        "name": "BureauOfLaborStatistics",
        "abbreviation": "BLS",
        "definition": "the Bureau of Labor Statistics, the principal Federal agency responsible for measuring labor market activity, working conditions, and price changes in the economy",
        "explanatoryNote": "Its mission is to collect, analyze, and disseminate essential economic information to support public and private decision-making. As an independent statistical agency, BLS serves its diverse user communities by providing products and services that are objective, timely, accurate, and relevant.",
        "label": "Bureau of Labor Statistics"
    },
    {
        "id": "UnitedStatesDepartmentOfLabor",
        "type": "GovernmentDepartment",
        "name": "UnitedStatesDepartmentOfLabor",
        "abbreviation": "DOL",
        "definition": "individual representing the U.S. Department of Labor, a government department whose mission is to foster, promote, and develop the welfare of the wage earners, job seekers, and retirees of the United States; improve working conditions; advance opportunities for profitable employment; and assure work-related benefits and rights",
        "label": "United States Department of Labor"
    }
]